/*  Previous - rtcnvram.c
 
 This file is distributed under the GNU Public License, version 2 or at
 your option any later version. Read the file gpl.txt for details.
 
 Emulation of Real Time Clock including NVRAM.
 
 Old systems use MC68HC68T1 chip, new systems use MCCS1850 chip.

 */

#include "ioMem.h"
#include "ioMemTables.h"
#include "m68000.h"
#include "configuration.h"
#include "dimension.h"
#include "sysReg.h"
#include "rtcnvram.h"

#include <time.h>


#define LOG_RTC_LEVEL   LOG_DEBUG


/* RTC interface */
#define RTC_ADDR_WRITE  0x80
#define RTC_ADDR_CLOCK  0x20
#define RTC_ADDR_MASK   0x7F
Uint8 rtc_addr = 0;
Uint8 rtc_val = 0;
int phase = 0;

int oldrtc_interface_io(Uint8 rtdatabit);
int newrtc_interface_io(Uint8 rtdatabit);

int rtc_interface_io(Uint8 rtdatabit) {
    switch (ConfigureParams.System.nRTC) {
        case MC68HC68T1: return oldrtc_interface_io(rtdatabit);
        case MCCS1850: return newrtc_interface_io(rtdatabit);
        default:
            Log_Printf(LOG_WARN, "[RTC] error: no I/O function for this chip!");
            return oldrtc_interface_io(rtdatabit); /* trying old chip */
    }
}

void rtc_interface_reset(void) {
    phase    = 0;
    rtc_addr = 0;
    rtc_val  = 0;
}


/* RTC power down request */
void oldrtc_request_power_down(void);
void newrtc_request_power_down(void);

void oldrtc_stop_pdown_request(void);
void newrtc_stop_pdown_request(void);

void rtc_request_power_down(void) {
    switch (ConfigureParams.System.nRTC) {
        case MC68HC68T1: oldrtc_request_power_down(); return;
        case MCCS1850: newrtc_request_power_down(); return;
        default:
            Log_Printf(LOG_WARN, "[RTC] error: no power down function for this chip!");
            oldrtc_request_power_down(); return; /* trying old chip */
    }
}

void rtc_stop_pdown_request(void) {
    switch (ConfigureParams.System.nRTC) {
        case MC68HC68T1: oldrtc_stop_pdown_request(); return;
        case MCCS1850: newrtc_stop_pdown_request(); return;
        default:
            Log_Printf(LOG_WARN, "[RTC] error: no power down function for this chip!");
            oldrtc_stop_pdown_request(); return; /* trying old chip */
    }
}



/* --------------------- MC68HC68T1 --------------------- */

/* RTC NVRAM is located at address 0x00 to 0x1F (32 bytes),
 * time registers, alarm registers and control/status
 * registers are located at address 0x20 to 0x32.
 */

Uint8 rtc_get_clock(Uint8 addr);
void rtc_put_clock(Uint8 addr, Uint8 val);

/* All time values in RTC clock are in packed decimal format */

typedef struct {
    Uint8 sec;      /* 00 - 59 */
    Uint8 min;      /* 00 - 59 */
    Uint8 hour;     /* 01 - 12 or 00 - 24; bit 7: 1 = 12 hr, 0 = 24 hr; bit 5: 1 = pm, 0 = am */
    Uint8 wday;     /* 01 - 07; 1 = sunday */
    Uint8 mday;     /* 01 - 31 */
    Uint8 month;    /* 01 - 12; 1 = january */
    Uint8 year;     /* 00 - 99 */
} RTC_TIME;

RTC_TIME get_rtc_time(void);

typedef struct {
    Uint8 sec;      /* 00 - 59 */
    Uint8 min;      /* 00 - 59 */
    Uint8 hour;     /* 01 - 12 or 00 - 24; bit 5: 1 = pm, 0 = am in 24 hr mode */
} RTC_ALARM;


/* There are 3 status and control registers inside the chip */

/* RTC Status Register at 0x30 (r only)
 *
 * 0-0- ----    always 0 (0 in bit 7 identifies MC68HC68T1 chip)
 * -x-- ----    watchdog detected cpu failure
 * ---x ----    first time up
 * ---- x---    interrupt true (one of following interrupts is valid)
 * ---- -x--    power sense interrupt
 * ---- --x-    alarm interrupt
 * ---- ---x    clock interrupt
 */

#define RTC_CPUFAIL     0x40
#define RTC_FIRSTUP     0x10
#define RTC_INT         0x08
#define RTC_INT_SENSE   0x04
#define RTC_INT_ALARM   0x02
#define RTC_INT_CLOCK   0x01


/* RTC Clock Control Register at 0x31 (r) or 0xB1 (w)
 *
 * x--- ----    1 = start, 0 = stop counter
 * -x-- ----    1 = enable line input, 0 = enable chrystal input
 * --xx ----    chrystal select: 0 = 4.194304 MHz, 1 = 2.097152, 2 = 1.048576, 3 = 32.768 kHz
 * ---- x---    1 = line input 50 Hz, 0 = line input 60 Hz
 * ---- -xxx    clock out frequency:
 *
 * 0 = chrystal
 * 1 = chrystal/2
 * 2 = chrystal/4
 * 3 = chrystal/8
 * 4 = disable
 * 5 = 1 Hz
 * 6 = 2 Hz
 * 7 = 50/60 Hz for line operation; 64 Hz for chrystal operation
 */

#define RTC_START   0x80
#define RTC_STOP    0x00
#define RTC_LINE    0x40
#define RTC_XTAL    0x30
#define RTC_L50HZ   0x08
#define RTC_FREQ    0x07


/* RTC Interrupt Control Register at 0x32 (r) or 0xB2 (w)
 *
 * x--- ----    watchdog enable
 * -x-- ----    initiate power down
 * --x- ----    power sense
 * ---x ----    enable alarm
 * ---- xxxx    select frequency of periodic interrupt:
 *
 * 0 = diable
 * chrystal:
 * 1 = 2048 Hz, 2 = 1024 Hz, ... , C = 1 Hz
 * D = 1 per min, E = 1 per hour, F = 1 per day
 * line:
 * 6 = 50 or 60 Hz, B = 2 Hz, C = 1 Hz
 * D = 1 per min, E = 1 per hour, F = 1 per day
 */

#define RTC_WATCHDOG    0x80
#define RTC_POWERDOWN   0x40
#define RTC_PWRSENSE    0x20
#define RTC_ENABLEALRM  0x10
#define RTC_PERIODIC    0x0F

struct {
    Uint8 ram[32];      /* 0x00 - 0x1F (r), 0x80 - 0x9F (w) */
    RTC_TIME time;      /* 0x20 - 0x26 (r), 0xA0 - 0xA6 (w) */
    RTC_ALARM alarm;    /* 0xA8 - 0xAA (w) */
    Uint8 status;       /* 0x30 (r) */
    Uint8 clkctrl;      /* 0x31 (r), 0xB1 (w) */
    Uint8 intctrl;      /* 0x32 (r), 0xB2 (w) */
} rtc;


int oldrtc_interface_io(Uint8 rtdatabit) {
    
    phase++;
    
    if (phase<=8) {
        rtc_addr = (rtc_addr<<1)|(rtdatabit?1:0);
    } else {
        
        if (phase==9) {
            if (!(rtc_addr&RTC_ADDR_WRITE)) {
                if (rtc_addr&RTC_ADDR_CLOCK) {
                    rtc_val = rtc_get_clock(rtc_addr);
                } else {
                    rtc_val = rtc.ram[rtc_addr&RTC_ADDR_MASK];
                }
                
                Log_Printf(LOG_RTC_LEVEL,"[RTC] reading val $%02X from addr $%02X at PC=$%08x\n",
                           rtc_val,rtc_addr,m68k_getpc());
            }
        }
        
        if (rtc_addr&RTC_ADDR_WRITE) {
            rtc_val = (rtc_val<<1)|(rtdatabit?1:0);
        } else {
            rtdatabit = (rtc_val&(1<<(16-phase)))?1:0;
        }
        
        if (phase==16) {
            if (rtc_addr&RTC_ADDR_WRITE) {
                Log_Printf(LOG_RTC_LEVEL,"[RTC] writing val $%02X to addr $%02X at PC=$%08x\n",
                           rtc_val,rtc_addr,m68k_getpc());
                
                if (rtc_addr&RTC_ADDR_CLOCK) {
                    rtc_put_clock(rtc_addr, rtc_val);
                } else {
                    rtc.ram[rtc_addr&RTC_ADDR_MASK] = rtc_val;
                }
            }
            
            switch (rtc_addr) {
                case 0x1F:
                case 0x9F: rtc_addr = 0x00; break;
                case 0x32:
                case 0xB2: rtc_addr = 0x20; break;
                default: rtc_addr++; break;
            }
            phase-=8;
        }
    }
    
    /* RTC returns 0 or 1 */
    return rtdatabit;
}

static Uint8 toBCD(int val) {
    return (((val/10)%10)<<4)|(val%10);
}

/* Year is supported up to 2050 through overflow of decimal decade */
static Uint8 toBCDyr(int val) {
    return (((val/10)&0xF)<<4)|(val%10);
}

static int fromBCD(Uint8 bcd) {
    return ((bcd&0xF0)>>4)*10+(bcd&0xF);
}

static void my_get_rtc_time(void) {
    time_t tmp = host_unix_time();
    struct tm t =*gmtime(&tmp);
    
    rtc.time.sec   = toBCD(t.tm_sec);
    rtc.time.min   = toBCD(t.tm_min);
    rtc.time.hour  = toBCD(t.tm_hour);
    rtc.time.wday  = toBCD(t.tm_wday+1);
    rtc.time.mday  = toBCD(t.tm_mday);
    rtc.time.month = toBCD(t.tm_mon+1);
    rtc.time.year  = toBCDyr(t.tm_year);
}

static void my_set_rtc_time(int which,int val) {
    static struct tm t;
    
    t.tm_sec  = fromBCD(rtc.time.sec);
    t.tm_min  = fromBCD(rtc.time.min);
    t.tm_hour = fromBCD(rtc.time.hour);
    t.tm_wday = fromBCD(rtc.time.wday) - 1;
    t.tm_mday = fromBCD(rtc.time.mday);
    t.tm_mon  = fromBCD(rtc.time.month) - 1;
    t.tm_year = fromBCD(rtc.time.year);
    
    val = fromBCD(val);
    
    switch (which) {
        case 0:
            t.tm_sec=val;
            break;
        case 1:
            t.tm_min=val;
            break;
        case 2:
            t.tm_hour=val;
            break;
        case 3:
            t.tm_mday=val;
            break;
        case 4:
            t.tm_mon=val-1;
            break;
        case 5:
            t.tm_year=val;
            break;
    }
    
    Log_Printf(LOG_WARN,"setting %d to %x",which,val);
    
    host_set_unix_time(mktime(&t));
}

Uint8 rtc_get_clock(Uint8 addr) {
    Uint8 val = 0x00;
    
    my_get_rtc_time();
    
    switch (rtc_addr&RTC_ADDR_MASK) {
        case 0x20: /* seconds */
            val = rtc.time.sec; break;
        case 0x21: /* minutes */
            val = rtc.time.min; break;
        case 0x22: /* hours */
            val = rtc.time.hour; break;
        case 0x23: /* day of week (sunday = 1) */
            val = rtc.time.wday; break;
        case 0x24: /* day of month */
            val = rtc.time.mday; break;
        case 0x25: /* month */
            val = rtc.time.month; break;
        case 0x26: /* year (0 - 99) */
            val = rtc.time.year ; break;            
        case 0x30: /* status register */
            val = rtc.status;
            rtc.status &= RTC_INT_SENSE;
            break;
        case 0x31: /* clock control register */
            val = rtc.clkctrl; break;
        case 0x32: /* interrupt control register */
            val = rtc.intctrl; break;
            
        default: break;
    }
    
    return val;
}

void my_set_rtc_time(int which,int val);

void rtc_put_clock(Uint8 addr, Uint8 val) {
    switch (rtc_addr&RTC_ADDR_MASK) {
        case 0x20: /* seconds */
		my_set_rtc_time(0,val);
		break;
        case 0x21: /* minutes */
		my_set_rtc_time(1,val);
		break;
        case 0x22: /* hours */
		my_set_rtc_time(2,val);
		break;
        case 0x23: /* day of week (sunday = 1) */
		break;
        case 0x24: /* day of month */
		my_set_rtc_time(3,val);
		break;
        case 0x25: /* month */
		my_set_rtc_time(4,val);
		break;
        case 0x26: /* year (0 - 99) */
		my_set_rtc_time(5,val);
		break;
            
        case 0x28: /* alarm: seconds */
        case 0x29: /* alarm: minutes */
        case 0x2A: /* alarm: hours */
		Log_Printf(LOG_WARN,"Trying to program alarm (not implemented) %x",val);
            break; /* not yet! */
            
        case 0x31: /* clock control register */
            rtc.clkctrl = val;
            break;
        case 0x32: /* interrupt control register */
            rtc.intctrl = val;
            if (rtc.intctrl&RTC_POWERDOWN) {
                Log_Printf(LOG_WARN, "[RTC] Power down!");
                M68000_Stop();
            }
            break;
            
        default: break;
    }
}

void oldrtc_request_power_down(void) {
    set_interrupt(INT_POWER, SET_INT);
}

void oldrtc_stop_pdown_request(void) {
    set_interrupt(INT_POWER, RELEASE_INT);
}


/* ------------------------- MCCS1850 ------------------------- */

/* RTC NVRAM (64 bytes) is located at address 0x00 to 0x1F
 * and 0x40 to 0x5F, time registers, alarm registers and 
 * control/status registers are located at address 0x20 to 0x31.
 */

Uint8 newrtc_get_clock(Uint8 addr);
void newrtc_put_clock(Uint8 addr, Uint8 val);

/* New RTC has two 32 bit counters, one for time and one for alarm */

/* There are 3 status and control registers inside the chip */

/* RTC Status Register at 0x30 (r only)
 *
 * 1--- ----    always 1 (identifies MCCS1850 chip)
 * -0-- ----    always 0
 * --x- ----    test mode status
 * ---x ----    first time up
 * ---- x---    interrupt true (one of following interrupts is valid)
 * ---- -x--    low battery interrupt
 * ---- --x-    alarm interrupt
 * ---- ---x    power down interrupt
 */

#define NRTC_NEWCHIP    0x80
#define NRTC_TMODE      0x20
#define NRTC_FIRSTUP    0x10
#define NRTC_INT        0x08
#define NRTC_INT_LBAT   0x04
#define NRTC_INT_ALARM  0x02
#define NRTC_INT_PDOWN  0x01


/* RTC Control Register at 0x31 (r) or 0xB1 (w)
 *
 * x--- ----    1 = start, 0 = stop counter
 * -x-- ----    initiate power down
 * --x- ----    enable auto restart sequence
 * ---x ----    enable alarm
 * ---- x---    alarm clear (clear alarm int bit in status)
 * ---- -x--    first time up clear (clear first up bit in status)
 * ---- --x-    enable low battery interrupting
 * ---- ---x    request power down clear (clear power down int bit in status)
 *
 * ---- xx-x    always read as 0
 */

#define NRTC_CTRL_0     0x0D

#define NRTC_START      0x80
#define NRTC_STOP       0x00
#define NRTC_POWERDOWN  0x40
#define NRTC_AR         0x20
#define NRTC_ENABLEALRM 0x10
#define NRTC_CLRALARM   0x08
#define NRTC_CLRFTU     0x04
#define NRTC_LBE        0x02
#define NRTC_CLRPDOWN   0x01


struct {
    /* --> see old chip  * 0x00 - 0x1F (r), 0x80 - 0x9F (w) */
    Uint32 timecntr;    /* 0x20 - 0x23 (r), 0xA0 - 0xA3 (w) */
    Uint32 alarmcntr;   /* 0x24 - 0x27 (r), 0xA4 - 0xA7 (w) */
    Uint8 status;       /* 0x30 (r) */
    Uint8 control;      /* 0x31 (r), 0xB1 (w) */
    Uint8 ram2[32];     /* 0x40 - 0x5F (r), 0xC0 - 0xDF (w) */
} newrtc;

#define RTC_ADDR_NEWRAM 0x40

int newrtc_interface_io(Uint8 rtdatabit) {
    
    phase++;
    
    if (phase<=8) {
        rtc_addr = (rtc_addr<<1)|(rtdatabit?1:0);
    } else {
        
        if (phase==9) {
            if (!(rtc_addr&RTC_ADDR_WRITE)) {
                if (rtc_addr&RTC_ADDR_CLOCK) {
                    rtc_val = newrtc_get_clock(rtc_addr);
                } else {
                    if (rtc_addr&RTC_ADDR_NEWRAM) {
                        rtc_val = newrtc.ram2[rtc_addr&0x1F];
                    } else {
                        rtc_val = rtc.ram[rtc_addr&0x1F];
                    }
                }
                
                Log_Printf(LOG_RTC_LEVEL,"[newRTC] reading val $%02X from addr $%02X at PC=$%08x\n",
                           rtc_val,rtc_addr,m68k_getpc());
            }
        }
        
        if (rtc_addr&RTC_ADDR_WRITE) {
